{
    "class_name": "Sequential", 
    "keras_version": "2.2.4", 
    "config": {
        "layers": [
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_19", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "dtype": "float32", 
                    "activation": "elu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 987, 
                    "batch_input_shape": [
                        null, 
                        784
                    ], 
                    "use_bias": true, 
                    "activity_regularizer": null
                }
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.2, 
                    "noise_shape": null, 
                    "trainable": true, 
                    "seed": null, 
                    "name": "dropout_16"
                }
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_20", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "elu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 89, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.2, 
                    "noise_shape": null, 
                    "trainable": true, 
                    "seed": null, 
                    "name": "dropout_17"
                }
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_21", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "elu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 987, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.2, 
                    "noise_shape": null, 
                    "trainable": true, 
                    "seed": null, 
                    "name": "dropout_18"
                }
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_22", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "elu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 987, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.2, 
                    "noise_shape": null, 
                    "trainable": true, 
                    "seed": null, 
                    "name": "dropout_19"
                }
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_23", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "elu", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 987, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.2, 
                    "noise_shape": null, 
                    "trainable": true, 
                    "seed": null, 
                    "name": "dropout_20"
                }
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_24", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "softmax", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 10, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }
            }
        ], 
        "name": "sequential_4"
    }, 
    "backend": "tensorflow"
}